welcome = "Добро пожаловать! Ну что приступим к обучению?"

run = 'Скопируйте шаблон и переименуйте. К шаблону доступ будет только у вас и шаблон можете сохранить на любом диске или ПК. ' \
      'При регистрации в аккаунтах рекомендуем сразу вносить данные в таблицу и при любом изменении пароля или логина, данные в таблице тоже нужно менять.'

run1 = 'Вы можете работать как со своего ПК, так и с арендованного сервера. Свой ПК более безопасен и нет никаких рисков потери данных. А на сервере вы всегда можете увеличить мощность.'

run2 = 'а нет ничего больше'