welcome = "Добро пожаловать! Ну что приступим к обучению?"

run = 'Скопируйте шаблон и переименуйте. К шаблону доступ будет только у вас и шаблон можете сохранить на любом диске или ПК. ' \
      'При регистрации в аккаунтах рекомендуем сразу вносить данные в таблицу и при любом изменении пароля или логина, данные в таблице тоже нужно менять.'

run1 = 'Вы можете работать как со своего ПК, так и с арендованного сервера. Свой ПК более безопасен и нет никаких рисков потери данных. А на сервере вы всегда можете увеличить мощность.'

run2_1 = 'Минимальные системные требования для работы на ПК:\n- Процессор: от i5-3570 Intel Core или AMD Ryzen и частота процессора от 3,2 ГГц\
         \n- RAM: от 16 Gb и более \n- Жесткий диск на SSD от 128 Gb \n- ОС Windows (тестировалось на Win7, Win10, Win11, Win Server 2003-2012-2016)\
         \n- Браузер: Google Chrome \n- Проводной интернет со скорость не менее 15-20 Мбит/сек. \nПри несоблюдении требований к системе могут происходить сбои!'

run2_2 = 'Арендовать выделенный сервер вы можете на одном из ресурсов ниже, либо на любом другом.\
         \nУбедитесь что характеристики сервера совпадают с минимальными системными требованиями.\
         \nПосле аренды сервера вы получите RDP файл или другой способ для входа на ваш сервер.'
run2_2_1 = 'Работа с удаленным сервером происходит через программу Microsoft Remote Desktop, через нее можно подключиться и управлять устройством.'

run_sms = 'Регистрируем Zadarma или Plusofon'

#Задарма
run_zadarma = 'Регистрируетесь на сервисе Zadarma для приема смс. Смотрите видео инструкцию, состоящию из 2-х частей.\
              Либо нажимайте "Продолжить" и смотрите инструкцию с картинками'
zad1 = 'Выбираем  МОБИЛЬНЫЙ НОМЕР в разделе "Подключить номер"'
zad2 = 'далее "Мобильные + SMS"'
zad3 = 'далее "Россия" (НИ В КОЕМ СЛУЧАЕ НЕ ВЫБИРАЕМ ГОРОДСКОЙ НОМЕР С 499 или коды других городов)'
zad4 = 'Номер который стоит 120р - активируем и пополняем счет на 3.мес - 360р, чтобы был доступ к приему смс\
       \nПодтвердите номер основного вашего телефона \nВ настройках выберите виртуальные номера\
       и номер нужно продлить сразу на 3 мес тариф, тогда будет доступ к приему смс. Если не разобрались,\
       есть чат поддержки у них - достаточно быстро отвечают.'
zad5 = 'Добавляете документы в личный кабинет (паспорт и прописку и паспорт с фото) - ожидайте проверку.\
       \nПосле активации вашего номера, вам необходимо поставить галочку для приема СМС в разделе "SMS"'
zad7 = 'В таком формате у вас должны отображаться смс и робот их будет оттуда забирать определяя к какой карте они относятся\
       \n\nПосле того как ваш номер активирован и его можно использовать, этот номер используем для банков или платежных систем, с которыми вы будете работать.'

#Плюсофон
run_plusofon = 'Регистрируетесь на сервисе Plusofon для приема смс'
plus4 = 'Заполняете все обязательные поля'
plus5 = 'Нажимаем на кнопку “Сохранить и отправить”'
plus6 = 'После отправки заявления и его подтверждения, нужно подписать договор и отправить фото подписанного договора и селфи с подписанным договором'
plus8 = 'После верификации переходим в раздел “Номера”'
plus9 = 'Далее в “мобильные номера”'
plus11 = 'Покупаем номер'
plus12 = 'Потом переходим в раздел “Услуги”, следом в “API”'
plus14 = 'Пролистываем чуть вниз и включаем доступ к API'
plus15 = 'В разделе “Услуги”, “API” Сгенерировать токен. Пользователя выбираете, вашу почту\
         \n\nКопируете ваш API ключ и вставляете в шаблон настроек (в таблицу доступов)'

#Банки
run_bank = 'Банки и сервисы для оплаты товаров'
