welcome = "Добро пожаловать! Ну что приступим к обучению?"

run = 'Скопируйте шаблон и переименуйте. К шаблону доступ будет только у вас и шаблон можете сохранить на любом диске или ПК. ' \
      'При регистрации в аккаунтах рекомендуем сразу вносить данные в таблицу и при любом изменении пароля или логина, данные в таблице тоже нужно менять.'

run1 = 'Вы можете работать как со своего ПК, так и с арендованного сервера. Свой ПК более безопасен и нет никаких рисков потери данных. А на сервере вы всегда можете увеличить мощность.\
       \nБудете ставить на свой ПК или Сервер?'

run2_1 = 'Минимальные системные требования для работы на ПК:\n- Процессор: от i5-3570 Intel Core или AMD Ryzen и частота процессора от 3,2 ГГц\
         \n- RAM: от 16 Gb и более \n- Жесткий диск на SSD от 128 Gb \n- ОС Windows (тестировалось на Win7, Win10, Win11, Win Server 2003-2012-2016)\
         \n- Браузер: Google Chrome \n- Проводной интернет со скорость не менее 15-20 Мбит/сек. \nПри несоблюдении требований к системе могут происходить сбои!'
run2_2 = 'Арендовать выделенный сервер вы можете на одном из ресурсов ниже, либо на любом другом.\
         \nУбедитесь что характеристики сервера совпадают с минимальными системными требованиями.\
         \nПосле аренды сервера вы получите RDP файл или другой способ для входа на ваш сервер.'

run2_2_1 = 'Работа с удаленным сервером происходит через программу Microsoft Remote Desktop, через нее можно подключиться и управлять устройством.'

run_sms = 'Регистрируем Zadarma или Plusofon'

run_zadarma = 'Регистрируетесь на сервисе Zadarma для приема смс'

run_plusofon = ''