welcome = "Добро пожаловать! Ну что приступим к обучению?"

run = 'Скопируйте шаблон и переименуйте. К шаблону доступ будет только у вас и шаблон можете сохранить на любом диске или ПК. ' \
      'При регистрации в аккаунтах рекомендуем сразу вносить данные в таблицу и при любом изменении пароля или логина, данные в таблице тоже нужно менять.'

run1 = 'Вы можете работать как со своего ПК, так и с арендованного сервера. Свой ПК более безопасен и нет никаких рисков потери данных. А на сервере вы всегда можете увеличить мощность.'

run2_1 = 'Минимальные системные требования для работы на ПК:\n- Процессор: от i5-3570 Intel Core или AMD Ryzen и частота процессора от 3,2 ГГц\
         \n- RAM: от 16 Gb и более \n- Жесткий диск на SSD от 128 Gb \n- ОС Windows (тестировалось на Win7, Win10, Win11, Win Server 2003-2012-2016)\
         \n- Браузер: Google Chrome \n- Проводной интернет со скорость не менее 15-20 Мбит/сек. \nПри несоблюдении требований к системе могут происходить сбои!'

run2_2 = 'Арендовать выделенный сервер вы можете на одном из ресурсов ниже, либо на любом другом.\
         \nУбедитесь что характеристики сервера совпадают с минимальными системными требованиями.\
         \nПосле аренды сервера вы получите RDP файл или другой способ для входа на ваш сервер.'
run2_2_1 = 'Работа с удаленным сервером происходит через программу Microsoft Remote Desktop, через нее можно подключиться и управлять устройством.'


##################################Смс###################################
run_sms = 'Регистрируем Zadarma или Plusofon'

#Задарма
run_zadarma = 'Регистрируетесь на сервисе Zadarma для приема смс. Смотрите видео инструкцию, состоящию из 2-х частей.\
              Либо нажимайте "Продолжить" и смотрите инструкцию с картинками'
zad1 = 'Выбираем  МОБИЛЬНЫЙ НОМЕР в разделе "Подключить номер"'
zad2 = 'далее "Мобильные + SMS"'
zad3 = 'далее "Россия" (НИ В КОЕМ СЛУЧАЕ НЕ ВЫБИРАЕМ ГОРОДСКОЙ НОМЕР С 499 или коды других городов)'
zad4 = 'Номер который стоит 120р - активируем и пополняем счет на 3.мес - 360р, чтобы был доступ к приему смс\
       \nПодтвердите номер основного вашего телефона \nВ настройках выберите виртуальные номера\
       и номер нужно продлить сразу на 3 мес тариф, тогда будет доступ к приему смс. Если не разобрались,\
       есть чат поддержки у них - достаточно быстро отвечают.'
zad5 = 'Добавляете документы в личный кабинет (паспорт и прописку и паспорт с фото) - ожидайте проверку.\
       \nПосле активации вашего номера, вам необходимо поставить галочку для приема СМС в разделе "SMS"'
zad7 = 'В таком формате у вас должны отображаться смс и робот их будет оттуда забирать определяя к какой карте они относятся\
       \n\nПосле того как ваш номер активирован и его можно использовать, этот номер используем для банков или платежных систем, с которыми вы будете работать.'

#Плюсофон
run_plusofon = 'Регистрируетесь на сервисе Plusofon для приема смс'
plus4 = 'Заполняете все обязательные поля'
plus5 = 'Нажимаем на кнопку “Сохранить и отправить”'
plus6 = 'После отправки заявления и его подтверждения, нужно подписать договор и отправить фото подписанного договора и селфи с подписанным договором'
plus8 = 'После верификации переходим в раздел “Номера”'
plus9 = 'Далее в “мобильные номера”'
plus11 = 'Покупаем номер'
plus12 = 'Потом переходим в раздел “Услуги”, следом в “API”'
plus14 = 'Пролистываем чуть вниз и включаем доступ к API'
plus15 = 'В разделе “Услуги”, “API” Сгенерировать токен. Пользователя выбираете, вашу почту\
         \n\nКопируете ваш API ключ и вставляете в шаблон настроек (в таблицу доступов)'


##################################Банки#########################################
run_bank = 'Банки и сервисы для оплаты товаров'

#QIWI
run_qiwi = 'Регистрируемся на - QIWI Кошелек'
qiwi1 = 'Для регистрации на QIWI указываем номер который зарегистрировали на сервисе Zadarma\
        \nМожно выбрать любого оператора. Также подойдет любой нулевой тариф, главное чтобы приходили СМС.'
qiwi2 = 'Существует 3 статуса кошелька, для комфортной работы нам нужен последний из них, т.к. там максимальный допустимый остаток по счету и лимит на переводы.\
        \nСначала получаем “Основной”, загрузив паспорт \nПотом “Профессиональный”, одним из способов'
qiwi3 = 'Создание виртуальных карт \nНажимаем на свой номер и переходим в профиль'
qiwi4 = 'Переходим в раздел профиля “Настройки”'
qiwi5 = 'Активируем пакет QIWI Мастер и переходим в управление картами'
qiwi6 = 'Выпускаем нужное количество карт'
qiwi7 = 'Мы используем карты Qiwi Мастер Debit, с этой картой работа стабильней'

#Модульбанк
run_modul = 'Оставляем заявку в “Модульбанк”'
modul1 = 'Вводим почту, номер телефона и оставляем заявку\
        \nНомер телефона в Модульбанк для подтверждения оплаты, нужно указывать Ваш номер из Zadarma'


############################Регистрации аккаунтов############################
run_reg = 'Сервисы для регистрации аккаунтов\
          \n\nДля начала можно зарегистрироваться только на одном сервисе, далее, для комбинации, можете зарегистрироваться на остальных сервисах.'

#OnlineSIM
run_osim = 'Регистрируемся на сервисе - Бесплатные виртуальные номера для приема СМС, получения...'
osim1 = 'Пополняем баланс \nНажимаем на свой аккаунт'
osim2 = '> профиль'
osim3 = '> API key (копируем)'
osim4 = 'Проверка наличия номера для аренды:\
        \n\nМой аккаунт > прием СМС > поиск (страна - Россия, сайт - wildberries)'

#SMS-activate
run_activ = 'Регистрируемся на сервисе \nПополняем баланс'
activ1 = 'Нажимаем на свой аккаунт > Настройки'
activ2 = 'Сгенерировать новый ключ\
         \nAPI ключ так же отправят на почту при регистрации, с которой зарегистрируетесь на сервисе\
         \nAPI копируем и вставляем в настройках шаблона регистрации'
activ3 = 'Проверка наличия номера для аренды:\
         \n\nВ поиске выбора сервиса набираем wildberries'

#Vak-sms
run_vak = 'Регистрируемся на сервисе \nПополняем баланс'
vak1 = 'Нажимаем на “Личный кабинет”'
vak2 = 'Сгенерированный ваш ключ \nAPI копируем и вставляем в настройках шаблона регистрации'
vak3 = 'Проверка наличия номера для аренды:\
       \n\n На главной странице, на боковой панели( списки сервисов) прокручиваем вниз до wildberries'


############################Аренда и установка прокси############################
run_proxy = 'Варианты аренды прокси\
            \n\nДля начала отлично подойдет вариант аренды прокси, их можно арендовать в следующих сервисах, либо арендовать у нас\
            \nДля начала вам хватит 1-3 прокси'
proxy1 = 'Характеристики прокси: \n\nМобильные публичные (не более 3 человек на прокси) либо приватные (1 человек)\
        \n\nСмена ip раз в 10 минут или более. Лучше всего раз в 30 мин и более \nIPv4, Linux\Windows, оператор любой\
        \nsocks5 \n\nПокупку и обновление кодов можно делать без прокси на ваш страх и риск. Мы НЕ РЕКОМЕНДУЕМ использовать такой вариант'
proxy2 = 'Прокси устанавливаются в текстовый файл proxy.txt\
         \n\nДля этого просто открываем файл и вписываем туда ваш прокси в формате:\
         \n\nsocks5://admin:123456@134.220.126:40705 \nпротокол://логин:пароль@ip:порт'


################################ZennoLab#######################################
run_zenno = 'Регистрируемся на Zennolab c почтой указанной в договоре'
zenno_video = 'Видеоинструкция в 3-х частях'
zenno1 = 'После регистрации, вам необходимо обратиться к нам в чат поддержки  и сообщить,\
 что у вас есть доступ к вашей учетной записи ZennoLab, также нужно прикрепить скриншот экрана, где будет виден логин.\
         \n\nЛицензия выписывается только на почту, которая указана в договоре!\
         \n\nЕсли вы хотите использовать другую учетную запись, то для этого необходимо переделать договор.\
         \n\nПосле этого мы в ближайшее время выпишем лицензию на этот логин и вы сможете ее скачать.'
zenno2 = 'При входе в аккаунт вам нужно будет скачать Zennolab.\
         \n\nВам нужно нажать на кнопку “Посмотреть все доступные для скачивания версии” и выбрать версию 7.7.3.0'
zenno3 = 'Скачиваем файл по ссылке на ваш сервер/компьютер и устанавливаем его.\
 По умолчанию Zennolab устанавливается в документы, там и будет папка, в которую нужно поместить проект.\
         \n\nПримечание: Лицензия выписывается на ваш ip адрес. Если подключать ПК к другой сети,\
 то ваш ip адрес изменится и лицензия у вас перестанет работать, соответственно ПО запустится с ошибкой.'
zenno4 = 'Варианты решения:\
         \n\n1. Возвращаете ПК на место, где была установка, что бы ваш ip был таким, как в личном кабинете зенолаб.\
         \n\n2. В личном кабинете зенолаб удаляете старое устройство, а потом переустанавливаете ПО.'


##########################Разгадывание капчи###################################
run_captcha = 'Регистрируемся на Антикапча \n\nВыбираем раздел – “Я заказчик” \n\nПополняем баланс.'
captcha1 = 'Копируем API KEY из одноименного раздела (копируем в файл) \n\nПополняем на 100р (для начала хватит).'
captcha2 = 'Настройка в роботе \n\nПереходим в Настройки > Капчи > RuCaptcha'


############################Google JSON#######################################
run_json = 'Регистрируем почту Google \n\nДалее нам нужно скачать файл для интеграции робота с таблицами.\
           \n\nКАК создать JSON файл для интеграции гугл таблиц с роботом:\
           \nВ настройках, в разделе “Google таблицы”, есть подробная инструкция. Переходим по ссылке, и выполняем все пункты инструкции.'
json1 = 'Прикрепление json файла должно завершиться следующей страницей.'